<p align="center"><strong>Permiss&otilde;es de edi&ccedil;&atilde;o para alunos</strong> (abrir para estudantes)</p>

<p>As permiss&otilde;es do Hiperlivro permitem que o professor ou autor de conte&uacute;do defina uma estrutura inicial e permitir que a turma adicione conte&uacute;dos ao hiperlivro.</p>
<p>O funcionamento &eacute; an&aacute;logo a ferramenta wiki, por&eacute;m com maior facilidade para estrutura&ccedil;&atilde;o do conte&uacute;do entre p&aacute;ginas, cap&iacute;tulos e elementos contextuais.</p>
<p>S&atilde;o os seguintes n&iacute;veis de permiss&otilde;es (acumulativos):</p>
<table width="93%" border="0">
  
  <tr>
    <td>P&aacute;gina</td>
    <td>Editar p&aacute;gina. Adicionar e editar itens de gloss&aacute;rio, dicas e bibliografia.</td>
  </tr>
  <tr>
    <td>Cap&iacute;tulo</td>
    <td>Adicionar e editar p&aacute;ginas.</td>
  </tr>
  <tr>
    <td>Caminho de navega&ccedil;&atilde;o</td>
    <td>Adicionar e editar cap&iacute;tulos.</td>
  </tr>
  <tr>
    <td>Hiperlivro</td>
    <td>Adicionar e editar caminhos de navega&ccedil;&atilde;o</td>
  </tr>
</table>
<p>As permiss&otilde;es de edi&ccedil;&atilde;o s&atilde;o automaticamente herdades para contextos inferiores. Assim:</p>
<ul>
  <li>Uma p&aacute;gina criada em um cap&iacute;tulo aberto aos alunos &eacute; automaticamente edit&aacute;vel por alunos.</li>
  <li>Um cap&iacute;tulo criado em um caminho de navega&ccedil;&atilde;o edit&aacute;vel para alunos &eacute; automaticamente edit&aacute;vel por alunos;</li>
  <li>Um caminho de navega&ccedil;&atilde;o criado em um hiperlivro aberto para edi&ccedil;&atilde;o &eacute; automaticamente edit&aacute;vel por alunos.</li>
</ul>
<p>&Eacute; poss&iacute;vel restringir a edi&ccedil;&atilde;o de determinados caminhos de navega&ccedil;&atilde;o, cap&iacute;tulos ou p&aacute;ginas, dicas ou coment&aacute;rios, sugest&otilde;es de estudo ou bilbiografia,  e gloss&aacute;rio, mesmo que o contexto superior seja edit&aacute;vel. Para isso o professor deve clicar no &iacute;cone do cadeado (<img src="../../../../../../theme/libras/pix/i/unlock.gif" alt="cadeado" width="9" height="13" />).</p>
<p><strong>Grupos</strong></p>
<p>Ao definir permiss&otilde;es para edi&ccedil;&atilde;o os grupos torna-se relevantes e funcionam da seguinte forma:</p>
<p>Grupos visiveis: &eacute; possivel a visualiza&ccedil;&atilde;o de itens entre diferentes grupos. Quando o participante  adiciona um item de glossario, dica, bibliografia,  p&aacute;gina, cap&iacute;tulo ou caminho de navega&ccedil;&atilde;o, o item criado poder&aacute; ser editado apenas por membros do seu grupo ou por professores. Outros grupos podem apenas visualizar.</p>
<p>Grupos separados: os integrantes de determinado grupo n&atilde;o conseguem visualizar os itens criados por outro grupo. Quando uma p&aacute;gina dentro de um cap&iacute;tulo, pertencer a outro grupo, o conte&uacute;do da p&aacute;gina &eacute; substituido pela mensagem &quot;P&aacute;gina de outro grupo (grupos separados)&quot;. A listagem de cap&iacute;tulos mostra os cap&iacute;tulos de todos os grupos, por&eacute;m ...</p>
<p>&quot;Abrir para alunos&quot; possui os seguintes efeitos em rela&ccedil;&atilde;o aos grupos e n&iacute;veis:</p>
<table width="95%" border="0">
  <tr>
    <td width="4%">n&iacute;vel/tipo de grupo</td>
    <td width="28%">sem grupos</td>
    <td width="35%">grupos vis&iacute;veis</td>
    <td width="33%">grupos separados</td>
  </tr>
  <tr>
    <td>hiperlivro aberto</td>
    <td> Novos caminhos t&ecirc;m visualiza&ccedil;&atilde;o e edi&ccedil;&atilde;o compartilhada. Itens ja existentes idem.</td>
    <td>Novos caminhos t&ecirc;m apenas visualiza&ccedil;&atilde;o compartilhada. Edi&ccedil;&atilde;o apenas por membros do grupo que criou o caminho. Itens de &quot;Todos os participantes&quot;  podem ser editados.</td>
    <td>Novos caminhos t&ecirc;m visualiza&ccedil;&atilde;o e edi&ccedil;&atilde;o separada. Itens de &quot;Todos os participantes&quot;  podem ser editados.</td>
  </tr>
  <tr>
    <td>caminho aberto</td>
    <td>O nome e apresenta&ccedil;&atilde;o do caminho pode ser editado por todos. Novos cap&iacute;tulos compartilhados para edi&ccedil;&atilde;o e visualiza&ccedil;&atilde;o</td>
    <td><p>O nome e apresenta&ccedil;&atilde;o do caminho pode ser editado por todos. Novos cap&iacute;tulos s&atilde;o compartilhados para visualiza&ccedil;&atilde;o e separados por grupos para edi&ccedil;&atilde;o</p>    </td>
    <td><p>O nome e apresenta&ccedil;&atilde;o do caminho pode ser editado por todos. Novos capitulos separados para visualiza&ccedil;&atilde;o e edi&ccedil;&atilde;o</p>    </td>
  </tr>
  <tr>
    <td>cap&iacute;tulo aberto</td>
    <td>O nome do cap&iacute;tulo pode ser editado por todos. P&aacute;ginas criadas s&atilde;o compartilhadas para edi&ccedil;&atilde;o e visualiza&ccedil;&atilde;o.</td>
    <td>O nome do cap&iacute;tulo pode ser editado por todos do grupo. P&aacute;ginas criadas s&atilde;o compartilhadas na visualiza&ccedil;&atilde;o e separadas por grupo para edi&ccedil;&atilde;o (cada grupo edita as p&aacute;ginas que criou).</td>
    <td>O nome do cap&iacute;tulo pode ser editado por todos do grupo. P&aacute;ginas criadas s&atilde;o  separadas por grupo para edi&ccedil;&atilde;o e visualiza&ccedil;&atilde;o (cada grupo v&ecirc; e edita apenas as p&aacute;ginas que criou).</td>
  </tr>
  <tr>
    <td>p&aacute;ginas</td>
    <td>O conte&uacute;do da p&aacute;gina pode ser editado por todos. Elementos contextuais idem.</td>
    <td>O conte&uacute;do da p&aacute;gina pode ser editado pelo grupo que a pagina foi criada. Elementos contextuais idem.</td>
    <td>O conte&uacute;do da p&aacute;gina pode ser editado por todos. Elementos contextuais idem.</td>
  </tr>
  <tr>
    <td>elementos contextuais</td>
    <td>Itens podem ser editados por todos.</td>
    <td>Itens compartilhados para visualiza&ccedil;&atilde;o e separados para edi&ccedil;&atilde;o</td>
    <td>Itens separados para edi&ccedil;&atilde;o e visualiza&ccedil;&atilde;o.</td>
  </tr>
</table>
<p>Os itens criados pelo professor pertencem ao grupo &quot;Todos os participantes&quot;, o qual &eacute; exibido para todos os alunos, indiferente da op&ccedil;&atilde;o de grupos. </p>
<p>P&aacute;ginas criadas no grupo &quot;Todos os participantes&quot; podem ser liberados para edi&ccedil;&atilde;o apenas no modo &quot;sem grupos&quot; ou &quot;grupos vis&iacute;veis&quot;. N&atilde;o funcionando em &quot;grupos separados&quot;.</p>
