<p><img valign="absmiddle" src="<?php echo $CFG->wwwroot?>/mod/book/icon.gif">&nbsp;<b>Hiperlivro</b></p>
<ul>
  <p>O Hiperlivro é um editor de hiperm&iacute;dia que permite a cria&ccedil;&atilde;o de material para aprendizagem organizado em Caminhos de Navega&ccedil;&atilde;o, Cap&iacute;tulos, P&aacute;ginas, Elementos contextuais e Links entre P&aacute;ginas/Cap&iacute;tulos.</p>
  <p>O passo inicial na edi&ccedil;&atilde;o do Hiperlivro &eacute; definir o sum&aacute;rio/apresenta&ccedil;&atilde;o do caminho de navega&ccedil;&atilde;o padr&atilde;o. Para isso clique em &quot;Caminhos de Navega&ccedil;&atilde;o&quot; na parte superior da p&aacute;gina. Nesta tela podem ser adicionados novos caminhos de navega&ccedil;&atilde;o, a partir dos quais ser&atilde;o criados os cap&iacute;tulos.</p>
  <p>Ap&oacute;s definir o sum&aacute;rio do caminho de navega&ccedil;&atilde;o padr&atilde;o, o pr&oacute;ximo passo &eacute; a cria&ccedil;&atilde;o dos cap&iacute;tulos. Para isso clique no icone (<img src="../../../../pix/add.gif" width="11" height="11" />) abaixo do caminho de navega&ccedil;&atilde;o. &Eacute; poss&iacute;vel a cria&ccedil;&atilde;o de cap&iacute;tulos numa estrutura/hierarquia flexivel, podendo-se reutilizar cap&iacute;tulos j&aacute; criados. </p>
  <p>O pr&oacute;ximo passo ap&oacute;s a cria&ccedil;&atilde;o do cap&iacute;tulo &eacute; a cria&ccedil;&atilde;o das p&aacute;ginas. Para isso acesse o cap&iacute;yulo criado (clicando em seu nome na lista de cap&iacute;tulos abaixo dos caminhos de navega&ccedil;&atilde;o) e clique no icone (<img src="../../../../pix/add.gif" width="11" height="11" />) na &aacute;rea central da p&aacute;gina.</p>
  <p>Depois de criar a p&aacute;gina, &eacute; possivel adicionar elementos contextuais a mesma. Para isso clique nos &iacute;cones na parte inferior da tela. Os icones correspondem aos cadastros de Links, Gloss&aacute;rio, Coment&aacute;rios e Bibliografia.</p>
  <p>Links: Conte&uacute;dos que merecem um novo cap&iacute;tulo.<br />
  Gloss&aacute;rio: Defini&ccedil;&otilde;es e biografias, conte&uacute;dos que ficam para a posteridade e que s&atilde;o independente de contexto.<br />
  Coment&aacute;rios: Conte&uacute;dos que dependem do contexto e que s&oacute; tem significado naquele momento.<br />
  Bibliografia: Refer&ecirc;ncias bibliogr&aacute;ficas e indica&ccedil;&atilde;o de sites.</p>
</ul>
